#Задание No1
# Создайте несколько переменных разных типов.
# Проверьте к какому типу относятся созданные переменные.

a = 2
b = 3.12
c = 'привет'
d = True
e = (1, 2)
f = [1, 2]

print(type(a), type(b), type(c), type(d), type(e), type(f), sep='\n')
print(f'переменная a = {a}, тип {type(a)}')