# Задание No2
# Создайте в переменной data список значений разных типов перечислив их через запятую
# внутри квадратных скобок. Для каждого элемента в цикле выведите:
# ✔ порядковый номер начиная с единицы
# ✔ значение
# ✔ адрес в памяти
# ✔ размер в памяти
# ✔ хэш объекта
# ✔ результат проверки на целое число только если он положительный
# ✔ результат проверки на строку только если он положительный
# Добавьте в список повторяющиеся элементы и сравните на результаты.
import sys

data = [3, 3.12, 'Привет', True, (1,2), ['1','2']]

for i, item in enumerate(data, start=1):
    check_int = ', это целое число' if isinstance(item, int) else ''
    check_str = ', это строка' if isinstance(item, str) else ''


    print(f'Пордковый номер - {i}, '
          f'Значение - {item}, '
          f'Адрес в памяти - {id(item)}, '
          f' Размер в памяти - {sys.getsizeof(item)}, '
          f'Хэш - {hash(item)}'
          f'{check_int}'
          f'{check_str}')

    # if isinstance(item, int):
    #     print('это целое число', end=' ')
    # elif isinstance(item, str):
    #     print(', это строка')

