# Задание No3
# ✔ Напишите программу, которая получает целое число и возвращает его двоичное,
# восьмеричное строковое представление.
# ✔ Функции bin и oct используйте для проверки своего результата, а не для решения.
# Дополнительно:
# ✔ Попробуйте избежать дублирования кода
# в преобразованиях к разным системам счисления
# ✔ Избегайте магических чисел
# ✔ Добавьте аннотацию типов где это возможно


# system = int(input('В какую систему счисления перевести число? \n'
#                    f'Двоичная - Введите 2 \n'
#                    f'Восимеричная - Введите 8'))

def input_n():
    system: int = 0
    while system not in (2, 8):
        system = int(input('В какую систему счисления перевести число? \n'
                   f'Двоичная - Введите 2 \n'
                   f'Восимеричная - Введите 8'))
    return system

def dec_to_n(num: int, system: int) -> str:
    tmp_num: int = num
    new_num: str = ''

    while tmp_num != 0:
        mod: str = str(tmp_num % system)
        new_num = mod + new_num
        tmp_num //= system

    return new_num

if __name__ == '__main__':
    num = int(input('Введите целое число: '))
    print(dec_to_n(num, input_n()))
    print(f'число в двоичной системе - {bin(num)}, число в восьмеричной системе - {oct(num)}')


# b = bin(num)    #двоичная система счисления
# o = oct(num)    #восьмеричная
# print(o, b)