# Задание No4
# ✔ Напишите программу, которая вычисляет площадь круга и длину окружности по введённому диаметру.
# ✔ Диаметр не превышает 1000 у.е.
# ✔ Точность вычислений должна составлять не менее 42 знаков после запятой.

import math
import decimal

PI = decimal.Decimal(math.pi)
decimal.getcontext().prec = 42
d = decimal.Decimal(input('Введите диаметр круга, но не более 1000: '))

if d <= 1000:
    print(f' площадь круга с диаметром {d} = {PI * d ** 2 / 4}')
    print(f' длина окружности круга с диаметром {d} = {PI * d}')
else:
    print('диаметр не превышает 1000!')





