a = int(input("1 сторона - Введите число от 1 до 10 ________"))
b = int(input("2 сторона - Введите число от 1 до 10 ________"))
c = int(input("3 сторона - Введите число от 1 до 10 ________"))

if a + b < c or b + c < a or c + a < b:
    print("Ошибка ... такой треугольник не существует")
else:
    print("Теугольник существует")

    if a == b != c or a == c != b or c == b != a:
        print("Равнобедренный")
    elif a == b == c:
        print("Равносторонний")
    else:
        print("Разносторонний")
